The  RebarHostData  type exposes the following members.
 Methods
Name  |   Description
Dispose
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetAreaReinforcementsInHost
 Returns all AreaReinforcement elements hosted by the referenced element.
GetCommonCoverType
 If all exposed faces of the host have the same associated CoverType, return that CoverType; otherwise, return    a null reference (  Nothing  in Visual Basic)  .
GetCoverType
 Gets the CoverType associated with a face of the element.
GetExposedFaces
 Returns all the exposed faces, that is, those that have an associated CoverType.
GetFabricAreasInHost
 Returns all FabricArea elements hosted by the referenced element.
GetFabricSheetsInHost
 Returns all FabricSheet elements hosted by the referenced element.
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetPathReinforcementsInHost
 Returns all PathReinforcement elements hosted by the referenced element.
GetRebarContainersInHost
 Returns all RebarContainer elements hosted by the referenced element.
GetRebarHostData
 Gets a RebarHostData object referring to the specified rebar host element.
GetRebarsInHost
 Returns all Rebar elements hosted by the referenced element.
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
IsFaceExposed
 Checks whether the specified face is considered exposed, and therefore has an associated CoverType.
IsValidHost
 Reports whether the element is a valid rebar host.
IsValidHost(Element)
 Identifies whether a given element can host reinforcement.
SetCommonCoverType
 Associate a single CoverType with all exposed faces of the host element.
SetCoverType
 Associates the specified CoverType with the specified face of the element.
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 See Also
  RebarHostData Class
  Autodesk.Revit.DB.Structure Namespace